<a href="https://colab.research.google.com/github/Ahsan-Ehtesham/Data-Analysis-of-World-Population/blob/master/index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

🎯𝗔𝗻𝗮𝗹𝘆𝘇𝗶𝗻𝗴 𝘁𝗵𝗲 𝗪𝗼𝗿𝗹𝗱 𝗣𝗼𝗽𝘂𝗹𝗮𝘁𝗶𝗼𝗻
In this project, you will use the dataset by CIA World Factbook and explore how the world population spreads across different countries.
The data has information from only 261 different countries.

Dataset contains 262 rows and 11 columns like id, code, area, population, birth_rate, death_rate, migration_rate, population_growth.

𝗔𝗽𝗽𝗿𝗼𝗮𝗰𝗵/𝗣𝗿𝗼𝗷𝗲𝗰𝘁 𝗜𝗱𝗲𝗮
You will learn how to use SQL to answer the following analytical questions:
1. Which country has the highest population?
2. Which country has the least number of people?
3. Which country is witnessing the highest population growth?
4. Which is the most densely populated country in the world?

In [6]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db 

# Here we connect the Jupyter notebook to the database file.

In [7]:
%%sql

SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [13]:
%%sql
SELECT * FROM facts limit 10
--this line will make it possible to run a SQL query with Jupyter

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46),
 (6, 'ac', 'Antigua and Barbuda', 442, 442, 0, 92436, 1.24, 15.85, 5.69, 2.21),
 (7, 'ar', 'Argentina', 2780400, 2736690, 43710, 43431886, 0.93, 16.64, 7.33, 0.0),
 (8, 'am', 'Armenia', 29743, 28203, 1540, 3056382, 0.15, 13.61, 9.34, 5.8),
 (9, 'as', 'Australia', 7741220, 7682300, 58920, 22751014, 1.07, 12.15, 7.14, 5.65),
 (10, 'au', 'Austria', 83871, 82445, 1426, 8665550, 0.55, 9.41, 9.42, 5.56)]

## Which country has the highest and least population?

In [27]:
%%sql
SELECT name,max(population) FROM facts WHERE name<>'World';

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

In [28]:
%%sql
SELECT name,min(population) FROM facts WHERE name<>'World';

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

## Top 5 countries witnessing the highest population growth

In [38]:
%%sql
SELECT name,population_growth FROM facts WHERE name<>'World' ORDER BY population_growth DESC LIMIT 5;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]